#+archive: archive/%s_archive.gpg::g
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline author:t broken-links:mark
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:nil
#+options: todo:t |:t
#+title: Explore data from the Tesla API
#+date: [2020-11-29 Sun]
#+author: Greg Grubbs
#+email: gregory@dynapse.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+setupfile: ~/projects/emacs/org-themes/src/readtheorg_inline/readtheorg_inline.theme

* Import data using =sqlite=
  #+begin_src shell-script
    #!/usr/bin/env bash

    head -1 teslafi-2017-04.csv > bigmama.csv
    cat teslafi-*csv| grep -v 'data_id' >> bigmama.csv

    echo 'Whoa, big mama'
    wc -l bigmama.csv
  #+end_src
  #+begin_src bash :var datadir=data-path
    echo "Changing to ${datadir}"
    cd ${datadir}
    echo "Here I am in ${PWD}"
    # ./create-bigmama.sh
    # sqlite3 teslafi.db
  #+end_src

  #+RESULTS:
  | Changing | to | /home/gregj/data/teslafi |    |                          |
  | Here     | I  | am                       | in | /home/gregj/data/teslafi |

  #+begin_src sqlite
    .mode csv
    .import bigmama.csv teslafi_raw
  #+end_src
